stress_test/data/result.out
/script/myscript.lua: cannot open /script/myscript.lua: No such file or directory
/script/myscript.lua: cannot open /script/myscript.lua: No such file or directory
/script/myscript.lua: cannot open /script/myscript.lua: No such file or directory
Running 30s test @ https://www.google.co.jp/
  2 threads and 100 connections
  Thread calibration: mean lat.: 150.496ms, rate sampling interval: 442ms
  Thread calibration: mean lat.: 149.178ms, rate sampling interval: 416ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   126.88ms   78.47ms 657.41ms   95.98%
    Req/Sec    49.22     43.79   120.00     45.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  107.26ms
 75.000%  119.68ms
 90.000%  146.82ms
 99.000%  530.94ms
 99.900%  573.44ms
 99.990%  657.92ms
 99.999%  657.92ms
100.000%  657.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      83.967     0.000000            1         1.00
      95.359     0.100000          194         1.11
      98.495     0.200000          391         1.25
     101.311     0.300000          587         1.43
     103.871     0.400000          776         1.67
     107.263     0.500000          972         2.00
     108.927     0.550000         1068         2.22
     110.847     0.600000         1165         2.50
     113.279     0.650000         1262         2.86
     115.903     0.700000         1358         3.33
     119.679     0.750000         1455         4.00
     121.535     0.775000         1506         4.44
     124.415     0.800000         1553         5.00
     128.063     0.825000         1601         5.71
     132.223     0.850000         1652         6.67
     138.239     0.875000         1699         8.00
     141.183     0.887500         1722         8.89
     146.815     0.900000         1746        10.00
     153.855     0.912500         1771        11.43
     164.479     0.925000         1795        13.33
     172.031     0.937500         1820        16.00
     177.663     0.943750         1832        17.78
     189.311     0.950000         1843        20.00
     202.111     0.956250         1856        22.86
     225.535     0.962500         1868        26.67
     487.423     0.968750         1880        32.00
     495.359     0.971875         1886        35.56
     510.207     0.975000         1892        40.00
     517.631     0.978125         1899        45.71
     518.143     0.981250         1904        53.33
     520.447     0.984375         1910        64.00
     521.983     0.985938         1913        71.11
     525.311     0.987500         1916        80.00
     528.895     0.989062         1919        91.43
     531.967     0.990625         1922       106.67
     539.135     0.992188         1925       128.00
     543.743     0.992969         1927       142.22
     545.791     0.993750         1928       160.00
     549.375     0.994531         1930       182.86
     553.983     0.995313         1931       213.33
     558.591     0.996094         1933       256.00
     563.711     0.996484         1934       284.44
     563.711     0.996875         1934       320.00
     565.247     0.997266         1935       365.71
     568.319     0.997656         1936       426.67
     570.367     0.998047         1937       512.00
     570.367     0.998242         1937       568.89
     570.367     0.998437         1937       640.00
     573.439     0.998633         1938       731.43
     573.439     0.998828         1938       853.33
     599.551     0.999023         1939      1024.00
     599.551     0.999121         1939      1137.78
     599.551     0.999219         1939      1280.00
     599.551     0.999316         1939      1462.86
     599.551     0.999414         1939      1706.67
     657.919     0.999512         1940      2048.00
     657.919     1.000000         1940          inf
#[Mean    =      126.876, StdDeviation   =       78.473]
#[Max     =      657.408, Total count    =         1940]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3002 requests in 30.10s, 136.93MB read
Requests/sec:     99.72
Transfer/sec:      4.55MB